<a href="https://colab.research.google.com/github/sejallotliker/MLnow_2.0/blob/main/Section_5_Python_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Section 5_PythonPandas

Author:  `Sejal Lotliker`

Date: `14-06-2021`

#Pivot() function

---


It is a Function that return shaped DataFrame organized by given index/column values

In [2]:
import pandas as pd
import numpy as np

In [3]:
df=pd.DataFrame({'A':['one','one','one','two','two','two'],
                'B':['A','B','c','A','B','c'],
                'C':[1,2,3,4,5,6],
                'D':['p','q','r','s','t','u']
                })

In [4]:
df

     A  B  C  D
0  one  A  1  p
1  one  B  2  q
2  one  c  3  r
3  two  A  4  s
4  two  B  5  t
5  two  c  6  u

In [5]:
df.pivot(index='A', columns='B') ['C']

B    A  B  c
A
one  1  2  3
two  4  5  6

In [6]:
df.pivot(index='A', columns='B', values=['C','D'])

     C        D
B    A  B  c  A  B  c
A
one  1  2  3  p  q  r
two  4  5  6  s  t  u

#Nunique ( ) function

---
 This function counts the number of unique entries over rows or columns. It is very useful for the categorical features.

In [7]:
value_1= np.random.randint(10, size=10)
value_2= np.random.randint(10, size=10)
years= np.arange(2005,2015)
groups=['A','A','B','B','C','C','D','D','A','B']

my_var=pd.DataFrame({'Characters':groups,'Year':years,'Number_1':value_1, 'number_2':value_2})

In [8]:
my_var

  Characters  Year  Number_1  number_2
0          A  2005         2         7
1          A  2006         5         7
2          B  2007         1         9
3          B  2008         6         3
4          C  2009         1         5
5          C  2010         0         0
6          D  2011         2         9
7          D  2012         3         3
8          A  2013         5         7
9          B  2014         6         3

In [9]:
#my_var.Year.nunique()
my_var.Year.nunique

<bound method IndexOpsMixin.nunique of 0    2005
1    2006
2    2007
3    2008
4    2009
5    2010
6    2011
7    2012
8    2013
9    2014
Name: Year, dtype: int64>

In [10]:
my_var.Characters.unique()

array(['A', 'B', 'C', 'D'], dtype=object)

In [11]:
df.nunique()

A    2
B    3
C    6
D    6
dtype: int64

#Memory_usage() function

---



`Memory_usage()`

This is a function that returns how many memory each column uses in bytes.

It is especially used when we work with large dataframes.

In [12]:
df_memory= pd.DataFrame({'One':np.random.randn(100000),
                         'Two':np.random.randint(100, size=100000)})
df_memory.shape

(100000, 2)

In [13]:
df_memory.memory_usage()

Index       128
One      800000
Two      800000
dtype: int64

Memory usage of entire dataframe in mega bytes

In [14]:
df_memory.memory_usage().sum()/(1024**2)  #Converting into megabytes

1.5260009765625

#Select Datatypes ( )

#nsmallest and nlargest function

Used to find `n smallest` and `n largest` values in a dataframe.

In [21]:
var_1=pd.DataFrame({'class':[10,11,12,6,3,9,2],
                    'Marks':[54,98,67,55,23,67,78],
                    'Name':['Seema', 'meena','neena','rahul','Mitali','Manali','Ravindra' ],
                    'Age':[12,23,44,33,11,8,22]})
var_1

   class  Marks      Name  Age
0     10     54     Seema   12
1     11     98     meena   23
2     12     67     neena   44
3      6     55     rahul   33
4      3     23    Mitali   11
5      9     67    Manali    8
6      2     78  Ravindra   22

In [18]:
var_1.nsmallest(5,'class')

   class  Marks      Name  Age
6      2     78  Ravindra   22
4      3     23    Mitali   11
3      6     55     rahul   33
5      9     67    Manali    8
0     10     54     Seema   12

In [19]:
var_1.nsmallest(5,'Marks')

   class  Marks    Name  Age
4      3     23  Mitali   11
0     10     54   Seema   12
3      6     55   rahul   33
2     12     67   neena   44
5      9     67  Manali    8

In [22]:
var_1.nlargest(5,'Age')

   class  Marks      Name  Age
2     12     67     neena   44
3      6     55     rahul   33
1     11     98     meena   23
6      2     78  Ravindra   22
0     10     54     Seema   12